drop table menus;

create table menus(
menu_id int not null PRIMARY key AUTO_INCREMENT,
fk_business_id int not null,
menu_name varchar(20),
kilocalories decimal(7, 2), 
price int, 
likes tinyint
);

INSERT INTO menus(fk_business_id, menu_name, kilocalories, price, likes)
VALUES  
(5, '물냉면', 480.23, 8000, 3),        
(8, '아메리카노', 16.44, 4500, 6),       
(17, '고르곤졸라피자', 1046.27, 12000, 12),        
(6, '보쌈', 1288.24, 14000, 2),        
(15, '장국', 387.36, 8500, -1),        
(17, '까르보나라', 619.11, 9000, 10),        
(9, '바닐라마카롱', 160.62, 1500, 4),        
(16, '백순대', 681.95, 11000, 24),       
(6, '마늘보쌈', 1320.49, 16000, 7),        
(16, '양념순대볶음', 729.17, 12000, 0),        
(14, '단팥빵', 225.88, 1500, 13),        
(1, '간짜장', 682.48, 7000, 3),        
(9, '뚱카롱', 247.62, 2000, 8),      
(5, '비빔냉면', 563.45, 8000, 4),        
(10, '참치김밥', 532.39, 3000, 0),       
(2, '치즈떡볶이', 638.42, 5000, 15),        
(11, '플레인와플', 299.31, 6500, 2),        
(2, '찹쌀순대', 312.76, 3000, -4),        
(15, '육개장', 423.18, 8500, 2),        
(4, '국물떡볶이', 483.29, 4500, 1),        
(10, '돈가스김밥', 562.72, 4000, 0),        
(1, '삼선짬뽕', 787.58, 8000, 32),        
(11, '수플레팬케익', 452.37, 9500, 5),        
(4, '라볶이', 423.16, 5500, 0),        
(8, '모카프라푸치노', 216.39, 6000, 8),        
(14, '옛날팥빙수', 382.35, 8000, 2);
